import os
from pathlib import Path
from dotenv import load_dotenv
from datetime import datetime, timezone, timedelta, date

load_dotenv()


def get_env_var(name: str, default=None, required=False):
    value = os.getenv(name, default)
    if required and value is None:
        raise EnvironmentError(f"Required environment variable '{name}' not found")
    return value


class APISettings:
    """API keys and authentication."""
    AUTHENTICATION = {
        'GIGACHAT_API_AUTH': get_env_var("GIGACHAT_API_AUTH"),
        'TAVILY_API_KEY': get_env_var("TAVILY_API_KEY", required=True),
        'TELEGRAM_API_ID': get_env_var("TELEGRAM_API_ID", required=True),
        'TELEGRAM_API_HASH': get_env_var("TELEGRAM_API_HASH", required=True),
        'PHONE_NUM': get_env_var("PHONE_NUM"),
        'OPENROUTER_AI_MODEL': get_env_var("OPENROUTER_AI_MODEL"),
        'TOGETHER_API_KEY': get_env_var("TOGETHER_API_KEY"),
        'GOOGLE_CLOUD_API_KEY': get_env_var("GOOGLE_CLOUD_API_KEY"),
        'GMAIL': get_env_var("GMAIL"),
        'PASS_GMAIL': get_env_var("PASS_GMAIL_PYTHON_ARCHIVER"),
        'MAIL_SBER': get_env_var("MAIL_SBER")
    }


class RegionSettings:
    REGIONS_KEYWORDS = {
        "Нижегородская область": ["нижний новгород", "нижегород", "н.новгород"],
        "г. Москва": ["москва", "мск", "московский", "столица", "москвич"],
        "г. Санкт-Петербург": ["санкт-петербург", "питер", "спб", "петербург", "ленинград", "ленобл"],
        "Краснодарский край": ["краснодар", "краснодарский", "крд", "кубань", "краснодарский край"],
        "Чеченская Республика": ["чечня", "грозный", "грз", "чечен"],
        "Вологодская область": ["вологда", "вологодская", "вологодский", "вологодчина"],
        "Воронежская область": ["воронеж", "воронежская", "воронежский"],
        "г. Севастополь": ["севастополь", "севастопольский", "сева", "крымсевастополь"],
        "Еврейская автономная область": ["еврейская", "еао", "биробиджан", "еврейская автономия"],
        "Забайкальский край": ["забайкал", "забайкальский", "чита ", "читинская обл"],
        "Ивановская область": ["иваново", "ивановская", "ивановский", "иванов"],
        "Иркутская область": ["иркутск", "иркутская", "иркутский", "иркут"],
        "Кабардино-Балкарская Республика": ["кабардино-балкария", "кбр", "нальчик", "кабарда", "балкария"],
        "Калининградская область": ["калининград", "калининградская", "кёнигсберг", "калининградский"],
        "Калужская область": ["калуга", "калужская", "калужский", "калуж"],
        "Камчатский край": ["камчатка", "камчатский", "петропавловск-камчатский", "петропавловск"],
        "Карачаево-Черкесская Республика": ["карачаево-черкесия", "кчр", "черкесск", "карачай", "черкесия"],
        "Кемеровская область": ["кемерово", "кемеровская", "кузбасс", "кемеров", "кузнецкий бассейн"],
        "Кировская область": ["киров", "кировская", "кировский", "вятка", "киров"],
        "Костромская область": ["кострома", "костромская", "костромской", "костромич"],
        "Красноярский край": ["красноярск", "красноярский", "краснояр", "край", "красноярье"],
        "Курганская область": ["курган", "курганская", "курганский", "курган"],
        "Курская область": ["курск", "курская", "курский", "курск"],
        "Ленинградская область": ["ленинградская", "ленобласть", "спб область", "ленинград", "ленинградский"],
        "Липецкая область": ["липецк", "липецкая", "липецкий", "липецк"],
        "Магаданская область": ["магадан", "магаданская", "магаданский"],
        "Московская область": ["московская область", "подмосковье", "московский", "московская", "мск", "москв"],
        "Мурманская область": ["мурманск", "мурманская", "мурманский", "мурман"],
        "Ненецкий автономный округ": ["ненецкий", "нао", "нарьян-мар", "ненецкий округ"],
        "Новгородская область": ["новгород", "новгородская", "великий новгород", "новгородский"],
        "Новосибирская область": ["новосибирск", "новосибирская", "новосибирский", "нск"],
        "Омская область": ["омск", "омская", "омский"],
        "Оренбургская область": ["оренбург", "оренбургская", "оренбургский"],
        "Орловская область": ["орёл", "орловская", "орловский", "орлов"],
        "Пензенская область": ["пенза", "пензенская", "пензенский"],
        "Пермский край": ["пермь", "пермский", "пермский край", "пермское"],
        "Приморский край": ["приморье", "приморский", "владивосток", "приморский край"],
        "Псковская область": ["псков", "псковская", "псковский"],
        "Республика Адыгея": ["адыгея", "адыгейская", "майкоп", "республика адыгея"],
        "Республика Алтай": ["алтай", "горно-алтайск"],
        "Республика Башкортостан": ["башкортостан", "башкирия", "уфа"],
        "Республика Бурятия": ["бурятия", "улан-удэ", "бурятская"],
        "Республика Дагестан": ["дагестан", "махачкала", "дагестанская"],
        "Республика Ингушетия": ["ингушетия", "магас", "ингушская"],
        "Республика Калмыкия": ["калмыкия", "элиста", "калмыцкая"],
        "Республика Карелия": ["карелия", "петрозаводск", "карельская"],
        "Республика Коми": ["коми", "сыктывкар"],
        "Республика Крым": ["крым", "симферополь", "крымская"],
        "Республика Марий Эл": ["марий эл", "йошкар-ола", "марийская"],
        "Республика Мордовия": ["мордовия", "саранск", "мордов"],
        "Республика Саха (Якутия)": ["якутия", "саха", "якутск"],
        "Республика Северная Осетия": ["северная осетия", "алания", "владикавказ", "осетия"],
        "Республика Татарстан": ["татарстан", "казань", "татарская"],
        "Республика Тыва": ["тыва", "тува", "кызыл", "тыв"],
        "Республика Хакасия": ["хакасия", "абакан" "хакасская", "хакас"],
        "Ростовская область": ["ростов", "ростовская", "ростов-на-дону", "ростовский"],
        "Рязанская область": ["рязань", "рязанская", "рязанский"],
        "Самарская область": ["самара", "самарская", "самарский"],
        "Саратовская область": ["саратов", "саратовская", "саратовский"],
        "Сахалинская область": ["сахалин", "сахалинская", "южно-сахалинск"],
        "Свердловская область": ["свердловская", "екатеринбург", "свердловск"],
        "Смоленская область": ["смоленск", "смоленская", "смоленский"],
        "Ставропольский край": ["ставрополь", "ставропольский", "ставрополье"],
        "Тамбовская область": ["тамбов", "тамбовская", "тамбовский"],
        "Тверская область": ["тверь", "тверская", "тверской"],
        "Томская область": ["томск", "томская", "томский"],
        "Тульская область": ["тула", "тульская", "тульский"],
        "Тюменская область": ["тюмень", "тюменская", "тюменский"],
        "Удмуртская Республика": ["удмуртия", "ижевск", "удмуртская"],
        "Ульяновская область": ["ульяновск", "ульяновская", "ульяновский"],
        "Хабаровский край": ["хабаровск", "хабаровский", "хабаровское"],
        "Ханты-Мансийский автономный округ": ["ханты-мансийск", "ханты-мансийский", "югра", "хмао"],
        "Челябинская область": ["челябинск", "челябинская", "челябинский"],
        "Чувашская Республика": ["чувашия", "чебоксары", "чувашская"],
        "Чукотский автономный округ": ["чукотка", "чукотский", "анадырь"],
        "Ямало-Ненецкий автономный округ": ["ямал", "ямало-ненецкий", "салехард", "янао"],
        "Ярославская область": ["ярославль", "ярославская", "ярославский"],
        "Алтайский край": ["алтайский", "барнаул", "алтай"],
        "Амурская область": ["амурская", "благовещенск", "амурск"],
        "Архангельская область": ["архангельск", "архангельская", "архангельский"],
        "Астраханская область": ["астрахань", "астраханская", "астраханский"],
        "Белгородская область": ["белгород", "белгородская", "белгородский"],
        "Брянская область": ["брянск", "брянская", "брянский"],
        "Владимирская область": ["владимир", "владимирская", "владимирский"],
        "Волгоградская область": ["волгоград", "волгоградская", "волгоградский"]
    }


class ParserSettings:
    # SEARCH_LIMIT_PER_QUERY = 5
    # SEARCH_LIMIT_ALL_QUIRES = 999_999
    SEARCH_LIMIT_GOOGLE = 5
    SEARCH_LIMIT_TAVILY = 5
    SEARCH_LIMIT_TELEGRAM = 999_999

    DATE_FROM = str(date.today().replace(day=1))

    TRUSTED_SOURCES_DOMAINS = ["ria.ru", "tass.ru", "rbc.ru", "vedomosti.ru", "kommersant.ru",
                    "rg.ru", 'realty.rbc.ru', 'gipernn.ru', 'pravda-nn.ru',
                    'vremyan.ru', 'government-nnov.ru', 'nn.rbc.ru',
                    'domostroynn.ru', 'rbcrealty.ru'
                    ]

    TRUSTED_SOURCES_TELEGRAM_CHANNELS = ["russianmacro",
                              "domresearch",
                              "okoloCB",
                              "domclick",
                              "ria_realty",
                              "realty_rbc",
                              ]

    AVAILABLE_SOURCES = ['Telegram', 'Google', 'Tavily']
    AVAILABLE_CATEGORIES = [
        'Тренды на рынке недвижимости', 'Цены на недвижимость', 'Первичное жильё', 'Вторичное жильё', 'Доступность недвижимости',
        'Бизнес', 'Фонд оплаты труда'
    ]
    AVAILABLE_REGIONS = list(RegionSettings.REGIONS_KEYWORDS.keys())

    @classmethod
    def set_parser_settings(cls, parser_settings: dict = None):
        """
        Установить настройки парсера из словаря parser_settings.
        Ключи словаря должны совпадать с именами переменных класса.

        :param parser_settings: dict с настройками
        """
        for key, value in parser_settings.items():
            if not (hasattr(cls, key)):
                print(f"ParserSettings create new attribute '{key}'")
                setattr(cls, key, value)
            elif value != ['ALL']:
                setattr(cls, key, value)


class StorageSettings:
    OUTPUT_DIR = "outputs_data"
    OUTPUT_ABS_DIR = Path(__file__).resolve().parent.parent
    OUTPUT_DIR_PATH = OUTPUT_ABS_DIR / OUTPUT_DIR
    OUTPUT_DIR_PROCESSED = OUTPUT_DIR_PATH / "processed"
    OUTPUT_DIR_RAW = OUTPUT_DIR_PATH / "raw"
    OUTPUT_DIR_POST_PROCESSING = OUTPUT_DIR_PATH / "post_processing"
    # OUTPUT_DIR_TOPICS = OUTPUT_DIR_PATH / "topics"
    # OUTPUT_DIR_CLUSTERS = OUTPUT_DIR_PATH / "clusters"

