import os
from pathlib import Path
from dotenv import load_dotenv
from datetime import datetime, timezone, timedelta, date

load_dotenv()


def get_env_var(name: str, default=None, required=False):
    value = os.getenv(name, default)
    if required and value is None:
        raise EnvironmentError(f"Required environment variable '{name}' not found")
    return value


class APISettings:
    """API keys and authentication."""
    AUTHENTICATION = {
        'GIGACHAT_API_AUTH': get_env_var("GIGACHAT_API_AUTH"),
        'TAVILY_API_KEY': get_env_var("TAVILY_API_KEY", required=True),
        'TELEGRAM_API_ID': get_env_var("TELEGRAM_API_ID", required=True),
        'TELEGRAM_API_HASH': get_env_var("TELEGRAM_API_HASH", required=True),
        'PHONE_NUM': get_env_var("PHONE_NUM"),
        'OPENROUTER_AI_MODEL': get_env_var("OPENROUTER_AI_MODEL"),
        'TOGETHER_API_KEY': get_env_var("TOGETHER_API_KEY"),
        'GOOGLE_CLOUD_API_KEY': get_env_var("GOOGLE_CLOUD_API_KEY"),
        'GMAIL': get_env_var("GMAIL"),
        'PASS_GMAIL': get_env_var("PASS_GMAIL_PYTHON_ARCHIVER"),
        'MAIL_SBER': get_env_var("MAIL_SBER")
    }


class RegionSettings:
    REGIONS_KEYWORDS = {
        "Россия": ['рф', 'россия', 'российск', 'федерация'],
        "Нижегородская область": ["нижний новгород", "нижегород", "н.новгород", "дзержинск", "арзамас", "саров", "бор", "кстово"],
        "г. Москва": ["москва", "мск", "московский", "столица", "москвич"],
        "г. Санкт-Петербург": ["санкт-петербург", "питер", "спб", "петербург", "ленинград", "ленобл"],
        "Краснодарский край": ["краснодар", "краснодарский", "крд", "кубань", "краснодарский край", "сочи", "новороссийск", "армавир", "ейск", "геленджик"],
        "Чеченская Республика": ["чечня", "грозный", "грз", "чечен", "урус-мартан", "шали", "гудермес", "аргун"],
        "Вологодская область": ["вологда", "вологодская", "вологодский", "вологодчина", "череповец", "сокол", "великий устюг"],
        "Воронежская область": ["воронеж", "воронежская", "воронежский", "борисоглебск", "россош", "лиски"],
        "г. Севастополь": ["севастополь", "севастопольский", "сева", "крымсевастополь"],
        "Еврейская автономная область": ["еврейская", "еао", "биробиджан", "еврейская автономия"],
        "Забайкальский край": ["забайкал", "забайкальский", "чита ", "читинская обл", "краснокаменск", "борзя", "петровск-забайкальский"],
        "Ивановская область": ["иваново", "ивановская", "ивановский", "иванов", "кинешма", "шуя", "вичуга"],
        "Иркутская область": ["иркутск", "иркутская", "иркутский", "иркут", "братск", "ангарск", "усть-илимск", "усть-кут"],
        "Кабардино-Балкарская Республика": ["кабардино-балкария", "кбр", "нальчик", "кабарда", "балкария", "прохладный", "баксан", "нарткала"],
        "Калининградская область": ["калининград", "калининградская", "кёнигсберг", "калининградский", "советск", "черняховск", "балтийск"],
        "Калужская область": ["калуга", "калужская", "калужский", "калуж", "обнинск", "людиново", "киров"],
        "Камчатский край": ["камчатка", "камчатский", "петропавловск-камчатский", "петропавловск", "елизово", "вилючинск"],
        "Карачаево-Черкесская Республика": ["карачаево-черкесия", "кчр", "черкесск", "карачай", "черкесия", "карачаевск", "усть-джегута"],
        "Кемеровская область": ["кемерово", "кемеровская", "кузбасс", "кемеров", "кузнецкий бассейн", "новокузнецк", "прокопьевск", "ленинск-кузнецкий", "междуреченск"],
        "Кировская область": ["киров", "кировская", "кировский", "вятка", "киров", "кирово-чепецк", "слободской", "вятские поляны"],
        "Костромская область": ["кострома", "костромская", "костромской", "костромич", "буй", "шария", "нерехта"],
        "Красноярский край": ["красноярск", "красноярский", "краснояр", "край", "красноярье", "норильск", "ачинск", "канск", "железногорск"],
        "Курганская область": ["курган", "курганская", "курганский", "курган", "шадринск", "катайск"],
        "Курская область": ["курск", "курская", "курский", "курск", "железногорск", "курчатов", "льгов"],
        "Ленинградская область": ["ленинградская", "ленобласть", "спб область", "ленинград", "ленинградский", "выборг", "гатчина", "тверь"],
        "Липецкая область": ["липецк", "липецкая", "липецкий", "липецк", "елец", "грязи", "данков"],
        "Магаданская область": ["магадан", "магаданская", "магаданский"],
        "Московская область": ["московская область", "подмосковье", "московский", "московская", "мск", "москв", "подольск", "коломна", "мытищи", "люберцы", "электросталь", "химки", "балашиха", "королев", "серпухов", "щелково", "одинцово"],
        "Мурманская область": ["мурманск", "мурманская", "мурманский", "мурман", "апатиты", "североморск", "мончегорск"],
        "Ненецкий автономный округ": ["ненецкий", "нао", "нарьян-мар", "ненецкий округ"],
        "Новгородская область": ["новгород", "новгородская", "великий новгород", "новгородский", "боровичи", "старая русса", "чудово"],
        "Новосибирская область": ["новосибирск", "новосибирская", "новосибирский", "нск", "бердск", "куйбышев", "обь"],
        "Омская область": ["омск", "омская", "омский", "тарский", "калачинск"],
        "Оренбургская область": ["оренбург", "оренбургская", "оренбургский", "орск", "новотроицк", "бузулук"],
        "Орловская область": ["орёл", "орловская", "орловский", "орлов", "ливны", "мценск"],
        "Пензенская область": ["пенза", "пензенская", "пензенский", "кузнецк", "заречный"],
        "Пермский край": ["пермь", "пермский", "пермский край", "пермское", "березники", "соликамск", "чайковский"],
        "Приморский край": ["приморье", "приморский", "владивосток", "приморский край", "уссурийск", "находка", "артем"],
        "Псковская область": ["псков", "псковская", "псковский", "великие луки", "остров"],
        "Республика Адыгея": ["адыгея", "адыгейская", "майкоп", "республика адыгея"],
        "Республика Алтай": ["алтай", "горно-алтайск"],
        "Республика Башкортостан": ["башкортостан", "башкирия", "уфа", "стерлитамак", "салават", "нефтекамск", "октябрьский"],
        "Республика Бурятия": ["бурятия", "улан-удэ", "бурятская", "селенгинск", "гусиноозерск"],
        "Республика Дагестан": ["дагестан", "махачкала", "дагестанская", "дербент", "хасавюрт", "каспийск"],
        "Республика Ингушетия": ["ингушетия", "магас", "ингушская", "назрань", "малгобек"],
        "Республика Калмыкия": ["калмыкия", "элиста", "калмыцкая"],
        "Республика Карелия": ["карелия", "петрозаводск", "карельская", "кондопога", "сегежа"],
        "Республика Коми": ["коми", "сыктывкар", "ухта", "воркута", "печора"],
        "Республика Крым": ["крым", "симферополь", "крымская", "керчь", "евпатория", "ялта", "феодосия"],
        "Республика Марий Эл": ["марий эл", "йошкар-ола", "марийская", "волжск", "козьмодемьянск"],
        "Республика Мордовия": ["мордовия", "саранск", "мордов", "рузаевка", "ковылкино"],
        "Республика Саха (Якутия)": ["якутия", "саха", "якутск", "нерюнгри", "мирный", "ленск"],
        "Республика Северная Осетия": ["северная осетия", "алания", "владикавказ", "осетия", "беслан", "алан"],
        "Республика Татарстан": ["татарстан", "казань", "татарская", "набережные челны", "нижнекамск", "альметьевск"],
        "Республика Тыва": ["тыва", "тува", "кызыл", "тыв", "ак-довурак"],
        "Республика Хакасия": ["хакасия", "абакан", "хакасская", "хакас", "черногорск", "саяногорск"],
        "Ростовская область": ["ростов", "ростовская", "ростов-на-дону", "ростовский", "таганрог", "шахты", "новочеркасск", "волгодонск"],
        "Рязанская область": ["рязань", "рязанская", "рязанский", "касимов", "скопин"],
        "Самарская область": ["самара", "самарская", "самарский", "тольятти", "сызрань", "новокуйбышевск"],
        "Саратовская область": ["саратов", "саратовская", "саратовский", "энгельс", "балашов", "вольск"],
        "Сахалинская область": ["сахалин", "сахалинская", "южно-сахалинск", "корсаков", "холмск", "октябрьский"],
        "Свердловская область": ["свердловская", "екатеринбург", "свердловск", "нижний тагил", "каменск-уральский", "первоуральск"],
        "Смоленская область": ["смоленск", "смоленская", "смоленский", "вязьма", "рославль"],
        "Ставропольский край": ["ставрополь", "ставропольский", "ставрополье", "невинномысск", "пятигорск", "кисловодск", "ессентуки"],
        "Тамбовская область": ["тамбов", "тамбовская", "тамбовский", "мичуринск", "рассказово"],
        "Тверская область": ["тверь", "тверская", "тверской", "ржев", "вышний волочек"],
        "Томская область": ["томск", "томская", "томский", "северск", "стрежевой"],
        "Тульская область": ["тула", "тульская", "тульский", "новомосковск", "донской", "алексин"],
        "Тюменская область": ["тюмень", "тюменская", "тюменский", "тобольск", "ишим", "ялуторовск"],
        "Удмуртская Республика": ["удмуртия", "ижевск", "удмуртская", "сарапул", "глазов", "воткинск"],
        "Ульяновская область": ["ульяновск", "ульяновская", "ульяновский", "димитровград", "инза"],
        "Хабаровский край": ["хабаровск", "хабаровский", "хабаровское", "комсомольск-на-амуре", "амурск", "советская гавань"],
        "Ханты-Мансийский автономный округ": ["ханты-мансийск", "ханты-мансийский", "югра", "хмао", "сургут", "нижневартовск", "нефтеюганск"],
        "Челябинская область": ["челябинск", "челябинская", "челябинский", "магнитогорск", "златоуст", "миасс"],
        "Чувашская Республика": ["чувашия", "чебоксары", "чувашская", "новочебоксарск", "канаш", "алатырь"],
        "Чукотский автономный округ": ["чукотка", "чукотский", "анадырь", "певек", "билибино"],
        "Ямало-Ненецкий автономный округ": ["ямал", "ямало-ненецкий", "салехард", "янао", "новый уренгой", "ноябрьск", "надым"],
        "Ярославская область": ["ярославль", "ярославская", "ярославский", "рыбинск", "переславль-залесский"],
        "Алтайский край": ["алтайский", "барнаул", "алтай", "бийск", "рубрика", "новоалтайск"],
        "Амурская область": ["амурская", "благовещенск", "амурск", "свободный", "тында"],
        "Архангельская область": ["архангельск", "архангельская", "архангельский", "северодвинск", "котлас"],
        "Астраханская область": ["астрахань", "астраханская", "астраханский", "ахтубинск", "знаменск"],
        "Белгородская область": ["белгород", "белгородская", "белгородский", "старый оскол", "губкин"],
        "Брянская область": ["брянск", "брянская", "брянский", "клинцы", "новозыбков"],
        "Владимирская область": ["владимир", "владимирская", "владимирский", "ковров", "муром", "александров"],
        "Волгоградская область": ["волгоград", "волгоградская", "волгоградский", "волжский", "камышин"]
    }


class ParserSettings:
    SEARCH_LIMIT_GOOGLE = 5
    SEARCH_LIMIT_TAVILY = 5
    SEARCH_LIMIT_TELEGRAM = 999_999

    DATE_FROM = str(date.today().replace(day=1))

    TRUSTED_SOURCES_DOMAINS = ["ria.ru", "tass.ru", "rbc.ru", "vedomosti.ru", "kommersant.ru",
                    "rg.ru", 'realty.rbc.ru', 'gipernn.ru', 'pravda-nn.ru',
                    'vremyan.ru', 'government-nnov.ru', 'nn.rbc.ru',
                    'domostroynn.ru', 'rbcrealty.ru'
                    ]

    TRUSTED_SOURCES_TELEGRAM_CHANNELS = ["russianmacro",
                              "domresearch",
                              "okoloCB",
                              "domclick",
                              "ria_realty",
                              "realty_rbc",
                              ]

    AVAILABLE_SOURCES = ['Telegram', 'Google', 'Tavily']
    AVAILABLE_CATEGORIES = [
        'Тренды на рынке недвижимости', 'Цены на недвижимость', 'Первичное жильё', 'Вторичное жильё', 'Доступность недвижимости',
        'Бизнес', 'Фонд оплаты труда'
    ]
    AVAILABLE_REGIONS = list(RegionSettings.REGIONS_KEYWORDS.keys())

    @classmethod
    def set_parser_settings(cls, parser_settings: dict = None):
        """
        Установить настройки парсера из словаря parser_settings.
        Ключи словаря должны совпадать с именами переменных класса.

        :param parser_settings: dict с настройками
        """
        for key, value in parser_settings.items():
            if not (hasattr(cls, key)):
                print(f"ParserSettings create new attribute '{key}'")
                setattr(cls, key, value)
            elif value != ['ALL']:
                setattr(cls, key, value)


class StorageSettings:
    OUTPUT_DIR = "outputs_data"
    OUTPUT_ABS_DIR = Path(__file__).resolve().parent.parent
    OUTPUT_DIR_PATH = OUTPUT_ABS_DIR / OUTPUT_DIR
    OUTPUT_DIR_PROCESSED = OUTPUT_DIR_PATH / "processed"
    OUTPUT_DIR_RAW = OUTPUT_DIR_PATH / "raw"
    OUTPUT_DIR_POST_PROCESSING = OUTPUT_DIR_PATH / "post_processing"
    # OUTPUT_DIR_TOPICS = OUTPUT_DIR_PATH / "topics"
    # OUTPUT_DIR_CLUSTERS = OUTPUT_DIR_PATH / "clusters"

